/*
 * SysTick.c
 *
 * Created: 11.05.2022 14:25:21
 *  Author: User
 */ 

#include "SysTick.h"

static volatile uint16_t TimeMs = 0; 

/************************************************************************/
/*                                                                      */
/************************************************************************/
uint16_t GetTick(void)
{
	static volatile uint16_t MirrorTimeMs;
	ATOMIC_BLOCK(ATOMIC_RESTORESTATE)	//организаци€ атомарности операции, чтобы ничто не смогло вмешатьс€ в процесс изменени€ переменной.
	{
		MirrorTimeMs = TimeMs;		
	}
	return MirrorTimeMs;
}
/************************************************************************/
/*                                                                      */
/************************************************************************/
ISR (TIMER0_OVF_vect){
	TimeMs++;	TCNT0  = 5;}
/************************************************************************/
/*                                                                      */
/************************************************************************/
void SysTick_init(void)
{
	//настройка таймера на задержку в 1 мс
	TCCR0|=(1<<CS01)|(1<<CS00); //делим частоту на 64. —чет до 250 переполнений - ровно 1мс
	TCNT0 = 5; // до вершины остаетс€ 250 циклов
	TIMSK|=(1<<TOIE0); //разрешить прерывание по переполнению
}